In [2]:
# load libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
#load dataset
df = pd.read_csv("C:\\Users\\NMC\\Downloads\\adult.csv")

In [20]:
# first five rows
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [21]:
# Missing values count
missing_before = df.isnull().sum()
print(missing_before)

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education.num   32561 non-null  int64
 5   marital.status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital.gain    32561 non-null  int64
 11  capital.loss    32561 non-null  int64
 12  hours.per.week  32561 non-null  int64
 13  native.country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [23]:
df.describe()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [24]:
# Label Encoding 
from sklearn.preprocessing import LabelEncoder

# Label Encoder object
le = LabelEncoder()

# Apply Label Encoding on 'education' column
df['education'] = le.fit_transform(df['education'])

# Check result
df[['education']].head()

   education
0         11
1         11
2         15
3          5
4         15

In [13]:
#  One-Hot Encoding 
# Select categorical columns for One-Hot Encoding
categorical_cols = [
    'workclass',
    'marital.status',
    'occupation',
    'relationship',
    'race',
    'sex',
    'native.country'
]

# Apply One-Hot Encoding
df = pd.get_dummies(df, columns=categorical_cols, drop_first=True)

# Check dataframe
df.head()

,age,fnlwgt,education,education.num,capital.gain,capital.loss,hours.per.week,income,workclass_Federal-gov,workclass_Local-gov,...,native.country_Portugal,native.country_Puerto-Rico,native.country_Scotland,native.country_South,native.country_Taiwan,native.country_Thailand,native.country_Trinadad&Tobago,native.country_United-States,native.country_Vietnam,native.country_Yugoslavia
0,90,77053,11,9,0,4356,40,<=50K,False,False,...,False,False,False,False,False,False,False,True,False,False
1,82,132870,11,9,0,4356,18,<=50K,False,False,...,False,False,False,False,False,False,False,True,False,False
2,66,186061,15,10,0,4356,40,<=50K,False,False,...,False,False,False,False,False,False,False,True,False,False
3,54,140359,5,4,0,3900,40,<=50K,False,False,...,False,False,False,False,False,False,False,True,False,False
4,41,264663,15,10,0,3900,40,<=50K,False,False,...,False,False,False,False,False,False,False,True,False,False

In [25]:
#Scale numerical features using StandardScaler
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

# Numerical columns 
num_cols = [
    'age',
    'fnlwgt',
    'education.num',
    'capital.gain',
    'capital.loss',
    'hours.per.week'
]

# Apply scaling
df[num_cols] = scaler.fit_transform(df[num_cols])

# Check result
df[num_cols].head()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
0,3.769612,-1.067997,-0.420060,-0.14592,10.593507,-0.035429
1,3.183112,-0.539169,-0.420060,-0.14592,10.593507,-1.817204
2,2.010110,-0.035220,-0.031360,-0.14592,10.593507,-0.035429
3,1.130359,-0.468215,-2.363558,-0.14592,9.461864,-0.035429
4,0.177296,0.709482,-0.031360,-0.14592,9.461864,-0.035429

# Comparing model readiness before and after scaling.
Before scaling, numerical columns had different value ranges. Some columns had very large values, while others had small values.

After scaling, all numerical columns were converted to a similar scale with mean around 0 and standard deviation around 1.

This makes the dataset more suitable and fair for machine learning models.

# Distance-based algorithms
Algorithms like KNN and K-means use distances between points.
If features have very different scales, large values dominate the distance.
Scaling fixes this problem.

# Gradient-based algorithms
Algorithms like Linear Regression, Logistic Regression, Neural Networks use gradients to learn.
If features are on different scales, learning can be slow or unstable.
Scaling makes learning faster and more stable.

# Tree-based algorithms
Algorithms like Decision Trees, Random Forests are not affected by scaling.

# Summary
Scaling helps models perform better and ensures that no feature dominates just because of its scale.

In [26]:
# Save the processed dataset
df.to_csv("adult_processed.csv", index=False)

# Check
print("Processed dataset saved successfully!")

Processed dataset saved successfully!